"""
Name: {atiikah saesoh}
SID: {364211760045}
Group: {MIT212}
"""
"""
Question 5:
เขียนโปรแกรมเพื่อคำนวณพลังงานที่เราใช้ในการดำรงชีวิตในช่วงเวลา 
24 ชั่วโมง (Basal Metabolic Rate: BMR) และ 
TDEE คือค่า BMR บวกกับจำนวนแคลอรี่ที่เกิดจากการทำกิจกรรม หรือการออกกำลังกาย

#สมการการหาค่า BMR
BMR เพศชาย = (10 x น้ำหนัก (kg)) + (6.25 x ส่วนสูง (cm)) - (5 x อายุ (ปี)) + 5
BMR เพศหญิง = (10 x น้ำหนัก (kg)) + (6.25 x ส่วนสูง (cm)) - (5 x อายุ (ปี)) - 161

#สมการสำหรับหาค่า TDEE
TDEE = BMR x Activity Factor 

•	Activity Factor คือ ปัจจัยในการทำกิจกรรมหรือออกกำลังกาย ยิ่งคุณออกกำลังกายมากเท่าไหร่ ค่าActivity Factor ยิ่งเพิ่มมากขึ้นเท่านั้น  
•	Activity Factor = 1.2 การออกกำลังกายน้อยมาก หรือไม่ออกกำลังกายเลย (No exercise)
•	Activity Factor = 1.375 การออกกำลังกายน้อย ออกกำลังกาย 1-3 วันต่อสัปดาห์ (1-3 day per week)
•	Activity Factor = 1.55 การออกกำลังกายปานกลาง ออกกำลังกาย 3-5 วันต่อสัปดาห์ (3-5 day per week)
•	Activity Factor = 1.725 การออกกำลังกายหนัก ออกกำลังกาย 6-7 วันต่อสัปดาห์ (6-7 day per week)
•	Activity Factor = 1.9 การออกกำลังกายออกกำลังกายหนักมากหรือเป็นนักกีฬา (heavy exercise or sportsman)
หมายเหตุ:  โปรแกรมต้องแสดงผลทั้ง BMR และ TDEE 
โดยต้องมีฟังก์ชั่นชื่อ cal_bmr() สำหรับคำนวณค่า BMR 
และฟังก์ชั่นชื่อ cal_tdee() สำหรับคำนวณค่า TDEE
(5 คะแนน)
"""